ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/SDFM_SDFM_50268000h.xml
<module name="SDFM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="SDFM_SDIFLG" acronym="SDFM_SDIFLG" offset="0" width="32" description="SD Interrupt Flag Register.">
		<bitfield id="MIF" width="1" begin="31" end="31" resetval="0x0" description="Set whenever any 'error' interrupt [MF1-4,IFL1-4,IFH1-4,SDFFOVF1-4] is active" range="31" rwaccess="R"/>
	<bitfield id="SDFFINT4" width="1" begin="23" end="23" resetval="0x0" description="SDFIFO data ready interrupt for Ch4" range="23" rwaccess="R"/>
	<bitfield id="SDFFINT3" width="1" begin="22" end="22" resetval="0x0" description="SDFIFO data ready interrupt for Ch3" range="22" rwaccess="R"/>
	<bitfield id="SDFFINT2" width="1" begin="21" end="21" resetval="0x0" description="SDFIFO data ready interrupt for Ch2" range="21" rwaccess="R"/>
	<bitfield id="SDFFINT1" width="1" begin="20" end="20" resetval="0x0" description="SDFIFO data ready interrupt for Ch1   0: SDFIFO data ready interrupt has NOT occurred  1: SDFIFO data ready interrupt has occurred" range="20" rwaccess="R"/>
	<bitfield id="SDFFOVF4" width="1" begin="19" end="19" resetval="0x0" description="FIFO Overflow Flag for Ch4" range="19" rwaccess="R"/>
	<bitfield id="SDFFOVF3" width="1" begin="18" end="18" resetval="0x0" description="FIFO Overflow Flag for Ch3" range="18" rwaccess="R"/>
	<bitfield id="SDFFOVF2" width="1" begin="17" end="17" resetval="0x0" description="FIFO Overflow Flag for Ch2" range="17" rwaccess="R"/>
	<bitfield id="SDFFOVF1" width="1" begin="16" end="16" resetval="0x0" description="FIFO Overflow Flag for Ch1  0 - FIFO has not overflowed  1 - FIFO overflowed.  # words received in FIFO ' FIFO depth [16], NEW word is lost" range="16" rwaccess="R"/>
	<bitfield id="AF4" width="1" begin="15" end="15" resetval="0x0" description="Acknowledge flag for Filter 4  0:No new data available for Filter  [in non-FIFO mode]  1:New data available for Filter  [in non-FIFO mode]" range="15" rwaccess="R"/>
	<bitfield id="AF3" width="1" begin="14" end="14" resetval="0x0" description="Acknowledge flag for Filter 3  0:No new data available for Filter  [in non-FIFO mode]  1:New data available for Filter  [in non-FIFO mode]" range="14" rwaccess="R"/>
	<bitfield id="AF2" width="1" begin="13" end="13" resetval="0x0" description="Acknowledge flag for Filter 2  0:No new data available for Filter  [in non-FIFO mode]  1:New data available for Filter  [in non-FIFO mode]" range="13" rwaccess="R"/>
	<bitfield id="AF1" width="1" begin="12" end="12" resetval="0x0" description="Acknowledge flag for Filter 1  0:No new data available for Filter [in non-FIFO mode]  1:New data available for Filter [in non-FIFO mode]" range="12" rwaccess="R"/>
	<bitfield id="MF4" width="1" begin="11" end="11" resetval="0x0" description="Modulator Failure for Filter 4  0:Modulator is operating normally for Filter  1:Modulator failure for Filter" range="11" rwaccess="R"/>
	<bitfield id="MF3" width="1" begin="10" end="10" resetval="0x0" description="Modulator Failure for Filter 3  0:Modulator is operating normally for Filter  1:Modulator failure for Filter" range="10" rwaccess="R"/>
	<bitfield id="MF2" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure for Filter 2  0:Modulator is operating normally for Filter  1:Modulator failure for Filter" range="9" rwaccess="R"/>
	<bitfield id="MF1" width="1" begin="8" end="8" resetval="0x0" description="Modulator Failure for Filter 1  0:Modulator is operating normally for Filter  1:Modulator failure for Filter" range="8" rwaccess="R"/>
	<bitfield id="FLT4_FLG_CEVT2" width="1" begin="7" end="7" resetval="0x0" description="CEVT2 Interrupt flag for filter4  0:CEVT2 event has not occured  1:CEVT2  event has occurred" range="7" rwaccess="R"/>
	<bitfield id="FLT4_FLG_CEVT1" width="1" begin="6" end="6" resetval="0x0" description="CEVT1 Interrupt flag for filter4  0:CEVT1 event has not occured  1:CEVT1  event has occurred" range="6" rwaccess="R"/>
	<bitfield id="FLT3_FLG_CEVT2" width="1" begin="5" end="5" resetval="0x0" description="CEVT2 Interrupt flag for filter3  0:CEVT2 event has not occured  1:CEVT2  event has occurred" range="5" rwaccess="R"/>
	<bitfield id="FLT3_FLG_CEVT1" width="1" begin="4" end="4" resetval="0x0" description="CEVT1 Interrupt flag for filter3  0:CEVT1 event has not occured  1:CEVT1  event has occurred" range="4" rwaccess="R"/>
	<bitfield id="FLT2_FLG_CEVT2" width="1" begin="3" end="3" resetval="0x0" description="CEVT2 Interrupt flag for filter2  0:CEVT2 event has not occured  1:CEVT2  event has occurred" range="3" rwaccess="R"/>
	<bitfield id="FLT2_FLG_CEVT1" width="1" begin="2" end="2" resetval="0x0" description="CEVT1 Interrupt flag for filter2  0:CEVT1 event has not occured  1:CEVT1  event has occurred" range="2" rwaccess="R"/>
	<bitfield id="FLT1_FLG_CEVT2" width="1" begin="1" end="1" resetval="0x0" description="CEVT2 Interrupt flag for filter1  0:CEVT2 event has not occured  1:CEVT2  event has occurred" range="1" rwaccess="R"/>
	<bitfield id="FLT1_FLG_CEVT1" width="1" begin="0" end="0" resetval="0x0" description="CEVT1 Interrupt flag for filter1  0:CEVT1 event has not occured  1:CEVT1  event has occurred" range="0" rwaccess="R"/>
	</register><register id="SDFM_SDIFLGCLR" acronym="SDFM_SDIFLGCLR" offset="4" width="32" description="SD Module Interrupt Flag Clear Bits:   Writing a '1' will clear the respective flag bit in the SDIFLG register.  Writes of '0' are ignored.  Note: If user writes a '1' to clear a bit on the same cycle that the hardware is trying to set the bit to '1', then hardware has priority and the bit will not be cleared.">
		<bitfield id="MIF" width="1" begin="31" end="31" resetval="0x0" description="Flag-clear bit for SDFM Master Interrupt flag.   Writing a  1 to clear MIF flag in SDIFLG register  Writes of '0' are ignored.  Note: If the MIF flag is cleared and other Interrupts are still pending, MIF will again be set to 1 on the following SysClk cycle, and the INT output will be reasserted [pulsed low]" range="31" rwaccess="R/W1TS"/>
	<bitfield id="SDFFINT4" width="1" begin="23" end="23" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch4" range="23" rwaccess="R/W1TS"/>
	<bitfield id="SDFFINT3" width="1" begin="22" end="22" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch3" range="22" rwaccess="R/W1TS"/>
	<bitfield id="SDFFINT2" width="1" begin="21" end="21" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch2" range="21" rwaccess="R/W1TS"/>
	<bitfield id="SDFFINT1" width="1" begin="20" end="20" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch1" range="20" rwaccess="R/W1TS"/>
	<bitfield id="SDFFOVF4" width="1" begin="19" end="19" resetval="0x0" description="SDFIFO overflow clear Ch4" range="19" rwaccess="R/W1TS"/>
	<bitfield id="SDFFOVF3" width="1" begin="18" end="18" resetval="0x0" description="SDFIFO overflow clear Ch3" range="18" rwaccess="R/W1TS"/>
	<bitfield id="SDFFOVF2" width="1" begin="17" end="17" resetval="0x0" description="SDFIFO overflow clear Ch2" range="17" rwaccess="R/W1TS"/>
	<bitfield id="SDFFOVF1" width="1" begin="16" end="16" resetval="0x0" description="SDFIFO overflow clear Ch1" range="16" rwaccess="R/W1TS"/>
	<bitfield id="AF4" width="1" begin="15" end="15" resetval="0x0" description="Flag-clear bit for Acknowledge flag for Filter 4" range="15" rwaccess="R/W1TS"/>
	<bitfield id="AF3" width="1" begin="14" end="14" resetval="0x0" description="Flag Clear bit for AF3" range="14" rwaccess="R/W1TS"/>
	<bitfield id="AF2" width="1" begin="13" end="13" resetval="0x0" description="Flag Clear bit for AF2" range="13" rwaccess="R/W1TS"/>
	<bitfield id="AF1" width="1" begin="12" end="12" resetval="0x0" description="Flag Clear bit for AF1" range="12" rwaccess="R/W1TS"/>
	<bitfield id="MF4" width="1" begin="11" end="11" resetval="0x0" description="Flag Clear bit for MF4" range="11" rwaccess="R/W1TS"/>
	<bitfield id="MF3" width="1" begin="10" end="10" resetval="0x0" description="Flag Clear bit for MF3" range="10" rwaccess="R/W1TS"/>
	<bitfield id="MF2" width="1" begin="9" end="9" resetval="0x0" description="Flag Clear bit for MF2" range="9" rwaccess="R/W1TS"/>
	<bitfield id="MF1" width="1" begin="8" end="8" resetval="0x0" description="Flag Clear bit for MF1" range="8" rwaccess="R/W1TS"/>
	<bitfield id="FLT4_FLG_CEVT2" width="1" begin="7" end="7" resetval="0x0" description="Flag Clear bit for FLT4_FLG_CEVT2" range="7" rwaccess="R/W1TS"/>
	<bitfield id="FLT4_FLG_CEVT1" width="1" begin="6" end="6" resetval="0x0" description="Flag Clear bit for FLT4_FLG_CEVT1" range="6" rwaccess="R/W1TS"/>
	<bitfield id="FLT3_FLG_CEVT2" width="1" begin="5" end="5" resetval="0x0" description="Flag Clear bit for FLT3_FLG_CEVT2" range="5" rwaccess="R/W1TS"/>
	<bitfield id="FLT3_FLG_CEVT1" width="1" begin="4" end="4" resetval="0x0" description="Flag Clear bit for FLT3_FLG_CEVT1" range="4" rwaccess="R/W1TS"/>
	<bitfield id="FLT2_FLG_CEVT2" width="1" begin="3" end="3" resetval="0x0" description="Flag Clear bit for FLT2_FLG_CEVT2" range="3" rwaccess="R/W1TS"/>
	<bitfield id="FLT2_FLG_CEVT1" width="1" begin="2" end="2" resetval="0x0" description="Flag Clear bit for FLT2_FLG_CEVT1" range="2" rwaccess="R/W1TS"/>
	<bitfield id="FLT1_FLG_CEVT2" width="1" begin="1" end="1" resetval="0x0" description="Flag Clear bit for FLT1_FLG_CEVT2" range="1" rwaccess="R/W1TS"/>
	<bitfield id="FLT1_FLG_CEVT1" width="1" begin="0" end="0" resetval="0x0" description="Flag Clear bit for FLT1_FLG_CEVT1" range="0" rwaccess="R/W1TS"/>
	</register><register id="SDFM_SDCTL" acronym="SDFM_SDCTL" offset="8" width="16" description="SD Control Register.">
		<bitfield id="MIE" width="1" begin="13" end="13" resetval="0x0" description="Master SDy_ERR interrupt enable  0:SDy_ERR Interrupt and interrupt flags are disabled  1:SDy_ERR Interrupt and interrupt flags are enabled" range="13" rwaccess="R/W"/>
	<bitfield id="HZ4" width="1" begin="3" end="3" resetval="0x0" description="Flag Clear bit for HZ4" range="3" rwaccess="R/W1TS"/>
	<bitfield id="HZ3" width="1" begin="2" end="2" resetval="0x0" description="Flag Clear bit for HZ3" range="2" rwaccess="R/W1TS"/>
	<bitfield id="HZ2" width="1" begin="1" end="1" resetval="0x0" description="Flag Clear bit for HZ2" range="1" rwaccess="R/W1TS"/>
	<bitfield id="HZ1" width="1" begin="0" end="0" resetval="0x0" description="Flag Clear bit for HZ1" range="0" rwaccess="R/W1TS"/>
	</register><register id="SDFM_SDMFILEN" acronym="SDFM_SDMFILEN" offset="12" width="16" description="SD Master Filter Enable.">
		<bitfield id="MFE" width="1" begin="11" end="11" resetval="0x0" description="Master Filter Enable  0:All the four data filter units of SDFM module are disabled. All FIFOs      are cleared  1:Data filter units can be enabled if bit FEN is '1'." range="11" rwaccess="R/W"/>
	</register><register id="SDFM_SDSTATUS" acronym="SDFM_SDSTATUS" offset="14" width="16" description="SD Status Register.">
		<bitfield id="HZ4" width="1" begin="3" end="3" resetval="0x0" description="High-level Threshold crossing [Z] flag Ch4  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0:Comparator filter output '    SDCMPHZ4.HLTZ  1:Comparator filter output '=  SDCMPHZ4.HLTZ" range="3" rwaccess="R"/>
	<bitfield id="HZ3" width="1" begin="2" end="2" resetval="0x0" description="High-level Threshold crossing [Z] flag Ch3  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0:Comparator filter output '    SDCMPHZ3.HLTZ  1:Comparator filter output '=  SDCMPHZ3.HLTZ" range="2" rwaccess="R"/>
	<bitfield id="HZ2" width="1" begin="1" end="1" resetval="0x0" description="High-level Threshold crossing [Z] flag Ch2  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0:Comparator filter output '    SDCMPHZ2.HLTZ  1:Comparator filter output '=  SDCMPHZ2.HLTZ" range="1" rwaccess="R"/>
	<bitfield id="HZ1" width="1" begin="0" end="0" resetval="0x0" description="High-level Threshold crossing [Z] flag Ch1  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0:Comparator filter output '    SDCMPHZ1.HLTZ  1:Comparator filter output '=  SDCMPHZ1.HLTZ" range="0" rwaccess="R"/>
	</register><register id="SDFM_SDCTLPARM1" acronym="SDFM_SDCTLPARM1" offset="32" width="16" description="Control Parameter Register for Ch1.">
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1:SD Data is passed through a synchronizer." range="6" rwaccess="R/W"/>
	<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1:SD Clock is passed through a synchronizer." range="4" rwaccess="R/W"/>
	<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD1 Clock source select. 0:Clock source to SDFM filter is its channel clock. 1:Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="R/W"/>
	<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0:Mode0:Modulator clock running at 1x data rate 1:Reserved 2:Reserved 3:Reserved" range="1:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDFPARM1" acronym="SDFM_SDDFPARM1" offset="34" width="16" description="Data Filter Parameter Register for Ch1.">
		<bitfield id="SDSYNCEN" width="1" begin="12" end="12" resetval="0x0" description="PWM synchronization [SDSYNC] of data filter  0:PWM synchronization  of data filter is disabled  1:PWM synchronization of data filter is enabled  Note: SDSYNCx.SYNCSEL bits define which PWM signal is used to              synchronize PWMs" range="12" rwaccess="R/W"/>
	<bitfield id="SST" width="2" begin="11" end="10" resetval="0x0" description="Data filter structure  00:Data filter runs with a Sincfast structure 01:Data filter runs with a Sinc1 structure 10:Data filter runs with a Sinc2 structure 11:Data filter runs with a Sinc3 structure" range="11:10" rwaccess="R/W"/>
	<bitfield id="AE" width="1" begin="9" end="9" resetval="0x0" description="Data filter Acknowledge Enable  0:Acknowledge flag is disabled for the particular filter  1:Acknowledge flag is enabled for the particular filter" range="9" rwaccess="R/W"/>
	<bitfield id="FEN" width="1" begin="8" end="8" resetval="0x0" description="Filter Enable  0: The data filter is disabled and no data is produced  1: The data filter is enabled and data are produced in the data filter  Note: When filter is disabled, DOSR counter held in reset, filter data          erased. Also resets FIFO pointers and clears the FIFO" range="8" rwaccess="R/W"/>
	<bitfield id="DOSR" width="8" begin="7" end="0" resetval="0x0" description="Data filter Oversampling ratio  The actual oversampling ratio of data filter is DOSR + 1  These bits set the oversampling ratio of the data filter. 0x0FF represents an oversampling ratio of 256." range="7:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDPARM1" acronym="SDFM_SDDPARM1" offset="36" width="16" description="Data Parameter Register for Ch1.">
		<bitfield id="SH" width="5" begin="15" end="11" resetval="0x0" description="Shift Control These bits indicate by how many bits the 16-bit window is shifted up when 16-bit data representation is chosen." range="15:11" rwaccess="R/W"/>
	<bitfield id="DR" width="1" begin="10" end="10" resetval="0x0" description="Data filter Data representation  0:Data stored in16b2's complement  1:Data stored in32b2's complement" range="10" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT1CMPH1" acronym="SDFM_SDFLT1CMPH1" offset="38" width="16" description="High-level Threshold Register for Ch1.">
		<bitfield id="HLT" width="15" begin="14" end="0" resetval="0x32767" description="Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT1CMPL1" acronym="SDFM_SDFLT1CMPL1" offset="40" width="16" description="Low-level Threshold Register for Ch1.">
		<bitfield id="LLT" width="15" begin="14" end="0" resetval="0x0" description="Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCPARM1" acronym="SDFM_SDCPARM1" offset="42" width="16" description="Comparator Filter Parameter Register for Ch1.">
		<bitfield id="CEVT2SEL" width="2" begin="15" end="14" resetval="0x0" description="Comparator Event2 Select 00: COMPL1 01:COMPL1 OR COMPH1 10:COMPL2 11:COMPL2 OR COMPH2" range="15:14" rwaccess="R/W"/>
	<bitfield id="CEN" width="1" begin="13" end="13" resetval="0x0" description="Comparator Filter enable  0:Disable comparator filter  1:Enable comparator filter" range="13" rwaccess="R/W"/>
	<bitfield id="CEVT1SEL" width="2" begin="12" end="11" resetval="0x0" description="Comparator Event1 Select 00: COMPH1 01:COMPL1 OR COMPH1 10:COMPH2 11:COMPL2 OR COMPH2" range="12:11" rwaccess="R/W"/>
	<bitfield id="HZEN" width="1" begin="10" end="10" resetval="0x0" description="High level [Z] Threshold crossing output enable  0:Disable Higher level Threshold [Z] crossing  1:Enable Higher level Threhold [Z] crossing " range="10" rwaccess="R/W"/>
	<bitfield id="MFIE" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure Interrupt Enable  0:Disable modulator failure interrupt and its flag  1:Enable modulator failure interrupt and its flag" range="9" rwaccess="R/W"/>
	<bitfield id="CS1_CS0" width="2" begin="8" end="7" resetval="0x0" description="Comparator filter structure  00:Comparator filter runs with a sincfast structure 01:Comparator filter runs with a Sinc1 structure 10:Comparator filter runs with a Sinc2 structure 11:Comparator filter runs with a Sinc3 structure" range="8:7" rwaccess="R/W"/>
	<bitfield id="EN_CEVT2" width="1" begin="6" end="6" resetval="0x0" description="CEVT2 interrupt enable  0:Disable CEVT2 interrupt  1:Enable CEVT2 interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="EN_CEVT1" width="1" begin="5" end="5" resetval="0x0" description="CEVT1 interrupt enable  0:Disable CEVT1 interrupt  1:Enable CEVT1 interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="COSR" width="5" begin="4" end="0" resetval="0x0" description="Comparator Oversampling ratio.   The actual rate is COSR + 1. These bits set the oversampling ratio of the filter. 0x1F represents an oversampling ratio of 32" range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDATA1" acronym="SDFM_SDDATA1" offset="44" width="32" description="Data Filter Data Register (16 or 32bit) for Ch1.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDDATFIFO1" acronym="SDFM_SDDATFIFO1" offset="48" width="32" description="Filter Data FIFO Output(32b) for Ch1.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDCDATA1" acronym="SDFM_SDCDATA1" offset="52" width="16" description="Comparator Filter Data Register (16b) for Ch1.">
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Comparator Data output -16bonly" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDFLT1CMPH2" acronym="SDFM_SDFLT1CMPH2" offset="54" width="16" description="Second high level threhold  for CH1.">
		<bitfield id="HLT2" width="15" begin="14" end="0" resetval="0x32767" description="Second Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT1CMPHZ" acronym="SDFM_SDFLT1CMPHZ" offset="56" width="16" description="High-level (Z) Threshold Register for Ch1.">
		<bitfield id="HLTZ" width="15" begin="14" end="0" resetval="0x0" description="Unsigned High-level threshold [Z] for the comparator filter output  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator SDCMPHx, it does not have the ability to generate an interrupt." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFIFOCTL1" acronym="SDFM_SDFIFOCTL1" offset="58" width="16" description="FIFO Control Register for Ch1.">
		<bitfield id="OVFIEN" width="1" begin="15" end="15" resetval="0x0" description="SDFIFO Overflow interrupt enable  0:SDFIFO Overflow condition will not generate an interrupt  1:SDFIFO overflow condition generates an interrupt on SDy_ERR" range="15" rwaccess="R/W"/>
	<bitfield id="DRINTSEL" width="1" begin="14" end="14" resetval="0x0" description="Data-Ready Interrupt [DRINT] source select  0 = AF1          [Select non-FIFO data-ready interrupt]  1 = SDFFINT1 [Select FIFO data-ready interrupt]" range="14" rwaccess="R/W"/>
	<bitfield id="FFEN" width="1" begin="13" end="13" resetval="0x0" description="SDFIFO Enable  0: Disable FIFO operation 1: Enable FIFO operation  Note: When FIFO is disabled, FIFO contents are cleared" range="13" rwaccess="R/W"/>
	<bitfield id="FFIEN" width="1" begin="12" end="12" resetval="0x0" description="SDFIFO data ready Interrupt Enable" range="12" rwaccess="R/W"/>
	<bitfield id="SDFFST" width="5" begin="10" end="6" resetval="0x0" description="SDFIFO Status  00000 FIFO empty 00001 FIFO has 1 word  . . . . 10000 FIFO has 16 words" range="10:6" rwaccess="R"/>
	<bitfield id="SDFFIL" width="5" begin="4" end="0" resetval="0x0" description="SDFIFO interrupt level bits   The FIFO will generate an interrupt when the FIFO status [SDFFST] '= FIFO level [SDFFIL ] " range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDSYNC1" acronym="SDFM_SDSYNC1" offset="60" width="16" description="SD Filter Sync control for Ch1.">
		<bitfield id="WTSCLREN" width="1" begin="10" end="10" resetval="0x1" description="WTSYNFLG Clear-on-FIFOINT Enable  0:WTSYNFLG can only be cleared manually [using WTSYNCLR bit]  1:WTSYNFLG is cleared automatically on SDFFINT" range="10" rwaccess="R/W"/>
	<bitfield id="FFSYNCCLREN" width="1" begin="9" end="9" resetval="0x0" description="FIFO Clear-on-SDSYNC Enable  0:SDFIFO is not automaticaly cleared upon receiving SDSYNC   1:SDFIFO is automaticaly cleared upon receiving SDSYNC" range="9" rwaccess="R/W"/>
	<bitfield id="WTSYNCLR" width="1" begin="8" end="8" resetval="0x0" description="Wait-for-Sync Flag Clear [always reads 0]  0:Write of 0 has no effect  1:Write of 1 clears WTSYNFLG" range="8" rwaccess="R/W"/>
	<bitfield id="WTSYNFLG" width="1" begin="7" end="7" resetval="0x0" description="Wait-for-Sync Flag  0:SDSYNC event has not occurred  1:SDSYNC event occurred.  " range="7" rwaccess="R"/>
	<bitfield id="WTSYNCEN" width="1" begin="6" end="6" resetval="0x0" description="Wait-for-Sync Enable  0:Incoming Data written to SDFIFO on every Data-Ready [DR] Event  1:Incoming Data written to SDFIFO on DR event only after SDSYNC event occurs" range="6" rwaccess="R/W"/>
	<bitfield id="SYNCSEL" width="6" begin="5" end="0" resetval="0x0" description="Defines source for the SDSYNC Input on this channel  Refer SDSYNCx.SYNCSEL table" range="5:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT1CMPL2" acronym="SDFM_SDFLT1CMPL2" offset="62" width="16" description="Second low level threhold  for CH1.">
		<bitfield id="LLT2" width="15" begin="14" end="0" resetval="0x0" description="Second Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
