ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/SDFM_SDFM_50268000h.xml
	</register><register id="SDFM_SDCTLPARM2" acronym="SDFM_SDCTLPARM2" offset="64" width="16" description="Control Parameter Register for Ch2.">
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1:SD Data is passed through a synchronizer." range="6" rwaccess="R/W"/>
	<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1:SD Clock is passed through a synchronizer." range="4" rwaccess="R/W"/>
	<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD2 Clock source select. 0:Clock source to SDFM filter is its channel clock. 1:Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="R/W"/>
	<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0:Mode0:Modulator clock running at 1x data rate 1:Reserved 2:Reserved 3:Reserved" range="1:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDFPARM2" acronym="SDFM_SDDFPARM2" offset="66" width="16" description="Data Filter Parameter Register for Ch2.">
		<bitfield id="SDSYNCEN" width="1" begin="12" end="12" resetval="0x0" description="PWM synchronization [SDSYNC] of data filter  0:PWM synchronization  of data filter is disabled  1:PWM synchronization of data filter is enabled  Note: SDSYNCx.SYNCSEL bits define which PWM signal is used to              synchronize PWMs" range="12" rwaccess="R/W"/>
	<bitfield id="SST" width="2" begin="11" end="10" resetval="0x0" description="Data filter structure  00:Data filter runs with a Sincfast structure 01:Data filter runs with a Sinc1 structure 10:Data filter runs with a Sinc2 structure 11:Data filter runs with a Sinc3 structure" range="11:10" rwaccess="R/W"/>
	<bitfield id="AE" width="1" begin="9" end="9" resetval="0x0" description="Data filter Acknowledge Enable  0:Acknowledge flag is disabled for the particular filter  1:Acknowledge flag is enabled for the particular filter" range="9" rwaccess="R/W"/>
	<bitfield id="FEN" width="1" begin="8" end="8" resetval="0x0" description="Filter Enable  0: The data filter is disabled and no data is produced  1: The data filter is enabled and data are produced in the data filter  Note: When filter is disabled, DOSR counter held in reset, filter data          erased. Also resets FIFO pointers and clears the FIFO" range="8" rwaccess="R/W"/>
	<bitfield id="DOSR" width="8" begin="7" end="0" resetval="0x0" description="Data filter Oversampling ratio  The actual oversampling ratio of data filter is DOSR + 1  These bits set the oversampling ratio of the data filter. 0x0FF represents an oversampling ratio of 256." range="7:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDPARM2" acronym="SDFM_SDDPARM2" offset="68" width="16" description="Data Parameter Register for Ch2.">
		<bitfield id="SH" width="5" begin="15" end="11" resetval="0x0" description="Shift Control These bits indicate by how many bits the 16-bit window is shifted up when 16-bit data representation is chosen." range="15:11" rwaccess="R/W"/>
	<bitfield id="DR" width="1" begin="10" end="10" resetval="0x0" description="Data filter Data representation  0:Data stored in16b2's complement  1:Data stored in32b2's complement" range="10" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT2CMPH1" acronym="SDFM_SDFLT2CMPH1" offset="70" width="16" description="High-level Threshold Register for Ch2.">
		<bitfield id="HLT" width="15" begin="14" end="0" resetval="0x32767" description="Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT2CMPL1" acronym="SDFM_SDFLT2CMPL1" offset="72" width="16" description="Low-level Threshold Register for Ch2.">
		<bitfield id="LLT" width="15" begin="14" end="0" resetval="0x0" description="Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCPARM2" acronym="SDFM_SDCPARM2" offset="74" width="16" description="Comparator Filter Parameter Register for Ch2.">
		<bitfield id="CEVT2SEL" width="2" begin="15" end="14" resetval="0x0" description="Comparator Event2 Select 00: COMPL1 01:COMPL1 OR COMPH1 10:COMPL2 11:COMPL2 OR COMPH2" range="15:14" rwaccess="R/W"/>
	<bitfield id="CEN" width="1" begin="13" end="13" resetval="0x0" description="Comparator Filter enable  0:Disable comparator filter  1:Enable comparator filter" range="13" rwaccess="R/W"/>
	<bitfield id="CEVT1SEL" width="2" begin="12" end="11" resetval="0x0" description="Comparator Event1 Select 00: COMPH1 01:COMPL1 OR COMPH1 10:COMPH2 11:COMPL2 OR COMPH2" range="12:11" rwaccess="R/W"/>
	<bitfield id="HZEN" width="1" begin="10" end="10" resetval="0x0" description="High level [Z] Threshold crossing output enable  0:Disable Higher level Threshold [Z] crossing  1:Enable Higher level Threhold [Z] crossing " range="10" rwaccess="R/W"/>
	<bitfield id="MFIE" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure Interrupt Enable  0:Disable modulator failure interrupt and its flag  1:Enable modulator failure interrupt and its flag" range="9" rwaccess="R/W"/>
	<bitfield id="CS1_CS0" width="2" begin="8" end="7" resetval="0x0" description="Comparator filter structure  00:Comparator filter runs with a sincfast structure 01:Comparator filter runs with a Sinc1 structure 10:Comparator filter runs with a Sinc2 structure 11:Comparator filter runs with a Sinc3 structure" range="8:7" rwaccess="R/W"/>
	<bitfield id="EN_CEVT2" width="1" begin="6" end="6" resetval="0x0" description="CEVT2 interrupt enable  0:Disable CEVT2 interrupt  1:Enable CEVT2 interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="EN_CEVT1" width="1" begin="5" end="5" resetval="0x0" description="CEVT1 interrupt enable  0:Disable CEVT1 interrupt  1:Enable CEVT1 interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="COSR" width="5" begin="4" end="0" resetval="0x0" description="Comparator Oversampling ratio.   The actual rate is COSR + 1. These bits set the oversampling ratio of the filter. 0x1F represents an oversampling ratio of 32" range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDATA2" acronym="SDFM_SDDATA2" offset="76" width="32" description="Data Filter Data Register (16 or 32bit) for Ch2.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDDATFIFO2" acronym="SDFM_SDDATFIFO2" offset="80" width="32" description="Filter Data FIFO Output(32b) for Ch2.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDCDATA2" acronym="SDFM_SDCDATA2" offset="84" width="16" description="Comparator Filter Data Register (16b) for Ch2.">
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Comparator Data output -16bonly" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDFLT2CMPH2" acronym="SDFM_SDFLT2CMPH2" offset="86" width="16" description="Second high level threhold  for CH2.">
		<bitfield id="HLT2" width="15" begin="14" end="0" resetval="0x32767" description="Second Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT2CMPHZ" acronym="SDFM_SDFLT2CMPHZ" offset="88" width="16" description="High-level (Z) Threshold Register for Ch2.">
		<bitfield id="HLTZ" width="15" begin="14" end="0" resetval="0x0" description="Unsigned High-level threshold [Z] for the comparator filter output  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator SDCMPHx, it does not have the ability to generate an interrupt." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFIFOCTL2" acronym="SDFM_SDFIFOCTL2" offset="90" width="16" description="FIFO Control Register for Ch2.">
		<bitfield id="OVFIEN" width="1" begin="15" end="15" resetval="0x0" description="SDFIFO Overflow interrupt enable  0:SDFIFO Overflow condition will not generate an interrupt  1:SDFIFO overflow condition generates an interrupt on SDy_ERR" range="15" rwaccess="R/W"/>
	<bitfield id="DRINTSEL" width="1" begin="14" end="14" resetval="0x0" description="Data-Ready Interrupt [DRINT] source select  0 = AF1          [Select non-FIFO data-ready interrupt]  1 = SDFFINT1 [Select FIFO data-ready interrupt]" range="14" rwaccess="R/W"/>
	<bitfield id="FFEN" width="1" begin="13" end="13" resetval="0x0" description="SDFIFO Enable  0: Disable FIFO operation 1: Enable FIFO operation  Note: When FIFO is disabled, FIFO contents are cleared" range="13" rwaccess="R/W"/>
	<bitfield id="FFIEN" width="1" begin="12" end="12" resetval="0x0" description="SDFIFO data ready Interrupt Enable" range="12" rwaccess="R/W"/>
	<bitfield id="SDFFST" width="5" begin="10" end="6" resetval="0x0" description="SDFIFO Status  00000 FIFO empty 00001 FIFO has 1 word  . . . . 10000 FIFO has 16 words" range="10:6" rwaccess="R"/>
	<bitfield id="SDFFIL" width="5" begin="4" end="0" resetval="0x0" description="SDFIFO interrupt level bits   The FIFO will generate an interrupt when the FIFO status [SDFFST] '= FIFO level [SDFFIL ] " range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDSYNC2" acronym="SDFM_SDSYNC2" offset="92" width="16" description="SD Filter Sync control for Ch2.">
		<bitfield id="WTSCLREN" width="1" begin="10" end="10" resetval="0x1" description="WTSYNFLG Clear-on-FIFOINT Enable  0:WTSYNFLG can only be cleared manually [using WTSYNCLR bit]  1:WTSYNFLG is cleared automatically on SDFFINT" range="10" rwaccess="R/W"/>
	<bitfield id="FFSYNCCLREN" width="1" begin="9" end="9" resetval="0x0" description="FIFO Clear-on-SDSYNC Enable  0:SDFIFO is not automaticaly cleared upon receiving SDSYNC   1:SDFIFO is automaticaly cleared upon receiving SDSYNC" range="9" rwaccess="R/W"/>
	<bitfield id="WTSYNCLR" width="1" begin="8" end="8" resetval="0x0" description="Wait-for-Sync Flag Clear [always reads 0]  0:Write of 0 has no effect  1:Write of 1 clears WTSYNFLG" range="8" rwaccess="R/W"/>
	<bitfield id="WTSYNFLG" width="1" begin="7" end="7" resetval="0x0" description="Wait-for-Sync Flag  0:SDSYNC event has not occurred  1:SDSYNC event occurred.  " range="7" rwaccess="R"/>
	<bitfield id="WTSYNCEN" width="1" begin="6" end="6" resetval="0x0" description="Wait-for-Sync Enable  0:Incoming Data written to SDFIFO on every Data-Ready [DR] Event  1:Incoming Data written to SDFIFO on DR event only after SDSYNC event occurs" range="6" rwaccess="R/W"/>
	<bitfield id="SYNCSEL" width="6" begin="5" end="0" resetval="0x0" description="Defines source for the SDSYNC Input on this channel  Refer SDSYNCx.SYNCSEL table" range="5:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT2CMPL2" acronym="SDFM_SDFLT2CMPL2" offset="94" width="16" description="Second low level threhold  for CH2.">
		<bitfield id="LLT2" width="15" begin="14" end="0" resetval="0x0" description="Second Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCTLPARM3" acronym="SDFM_SDCTLPARM3" offset="96" width="16" description="Control Parameter Register for Ch3.">
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1:SD Data is passed through a synchronizer." range="6" rwaccess="R/W"/>
	<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1:SD Clock is passed through a synchronizer." range="4" rwaccess="R/W"/>
	<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD3 Clock source select. 0:Clock source to SDFM filter is its channel clock. 1:Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="R/W"/>
	<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0:Mode0:Modulator clock running at 1x data rate 1:Reserved 2:Reserved 3:Reserved" range="1:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDFPARM3" acronym="SDFM_SDDFPARM3" offset="98" width="16" description="Data Filter Parameter Register for Ch3.">
		<bitfield id="SDSYNCEN" width="1" begin="12" end="12" resetval="0x0" description="PWM synchronization [SDSYNC] of data filter  0:PWM synchronization  of data filter is disabled  1:PWM synchronization of data filter is enabled  Note: SDSYNCx.SYNCSEL bits define which PWM signal is used to              synchronize PWMs" range="12" rwaccess="R/W"/>
	<bitfield id="SST" width="2" begin="11" end="10" resetval="0x0" description="Data filter structure  00:Data filter runs with a Sincfast structure 01:Data filter runs with a Sinc1 structure 10:Data filter runs with a Sinc2 structure 11:Data filter runs with a Sinc3 structure" range="11:10" rwaccess="R/W"/>
	<bitfield id="AE" width="1" begin="9" end="9" resetval="0x0" description="Data filter Acknowledge Enable  0:Acknowledge flag is disabled for the particular filter  1:Acknowledge flag is enabled for the particular filter" range="9" rwaccess="R/W"/>
	<bitfield id="FEN" width="1" begin="8" end="8" resetval="0x0" description="Filter Enable  0: The data filter is disabled and no data is produced  1: The data filter is enabled and data are produced in the data filter  Note: When filter is disabled, DOSR counter held in reset, filter data          erased. Also resets FIFO pointers and clears the FIFO" range="8" rwaccess="R/W"/>
	<bitfield id="DOSR" width="8" begin="7" end="0" resetval="0x0" description="Data filter Oversampling ratio  The actual oversampling ratio of data filter is DOSR + 1  These bits set the oversampling ratio of the data filter. 0x0FF represents an oversampling ratio of 256." range="7:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDPARM3" acronym="SDFM_SDDPARM3" offset="100" width="16" description="Data Parameter Register for Ch3.">
		<bitfield id="SH" width="5" begin="15" end="11" resetval="0x0" description="Shift Control These bits indicate by how many bits the 16-bit window is shifted up when 16-bit data representation is chosen." range="15:11" rwaccess="R/W"/>
	<bitfield id="DR" width="1" begin="10" end="10" resetval="0x0" description="Data filter Data representation  0:Data stored in16b2's complement  1:Data stored in32b2's complement" range="10" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT3CMPH1" acronym="SDFM_SDFLT3CMPH1" offset="102" width="16" description="High-level Threshold Register for Ch3.">
		<bitfield id="HLT" width="15" begin="14" end="0" resetval="0x32767" description="Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT3CMPL1" acronym="SDFM_SDFLT3CMPL1" offset="104" width="16" description="Low-level Threshold Register for Ch3.">
		<bitfield id="LLT" width="15" begin="14" end="0" resetval="0x0" description="Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCPARM3" acronym="SDFM_SDCPARM3" offset="106" width="16" description="Comparator Filter Parameter Register for Ch3.">
		<bitfield id="CEVT2SEL" width="2" begin="15" end="14" resetval="0x0" description="Comparator Event2 Select 00: COMPL1 01:COMPL1 OR COMPH1 10:COMPL2 11:COMPL2 OR COMPH2" range="15:14" rwaccess="R/W"/>
	<bitfield id="CEN" width="1" begin="13" end="13" resetval="0x0" description="Comparator Filter enable  0:Disable comparator filter  1:Enable comparator filter" range="13" rwaccess="R/W"/>
	<bitfield id="CEVT1SEL" width="2" begin="12" end="11" resetval="0x0" description="Comparator Event1 Select 00: COMPH1 01:COMPL1 OR COMPH1 10:COMPH2 11:COMPL2 OR COMPH2" range="12:11" rwaccess="R/W"/>
	<bitfield id="HZEN" width="1" begin="10" end="10" resetval="0x0" description="High level [Z] Threshold crossing output enable  0:Disable Higher level Threshold [Z] crossing  1:Enable Higher level Threhold [Z] crossing " range="10" rwaccess="R/W"/>
	<bitfield id="MFIE" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure Interrupt Enable  0:Disable modulator failure interrupt and its flag  1:Enable modulator failure interrupt and its flag" range="9" rwaccess="R/W"/>
	<bitfield id="CS1_CS0" width="2" begin="8" end="7" resetval="0x0" description="Comparator filter structure  00:Comparator filter runs with a sincfast structure 01:Comparator filter runs with a Sinc1 structure 10:Comparator filter runs with a Sinc2 structure 11:Comparator filter runs with a Sinc3 structure" range="8:7" rwaccess="R/W"/>
	<bitfield id="EN_CEVT2" width="1" begin="6" end="6" resetval="0x0" description="CEVT2 interrupt enable  0:Disable CEVT2 interrupt  1:Enable CEVT2 interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="EN_CEVT1" width="1" begin="5" end="5" resetval="0x0" description="CEVT1 interrupt enable  0:Disable CEVT1 interrupt  1:Enable CEVT1 interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="COSR" width="5" begin="4" end="0" resetval="0x0" description="Comparator Oversampling ratio.   The actual rate is COSR + 1. These bits set the oversampling ratio of the filter. 0x1F represents an oversampling ratio of 32" range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDATA3" acronym="SDFM_SDDATA3" offset="108" width="32" description="Data Filter Data Register (16 or 32bit) for Ch3.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDDATFIFO3" acronym="SDFM_SDDATFIFO3" offset="112" width="32" description="Filter Data FIFO Output(32b) for Ch3.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDCDATA3" acronym="SDFM_SDCDATA3" offset="116" width="16" description="Comparator Filter Data Register (16b) for Ch3.">
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Comparator Data output -16bonly" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDFLT3CMPH2" acronym="SDFM_SDFLT3CMPH2" offset="118" width="16" description="Second high level threhold  for CH3.">
		<bitfield id="HLT2" width="15" begin="14" end="0" resetval="0x32767" description="Second Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT3CMPHZ" acronym="SDFM_SDFLT3CMPHZ" offset="120" width="16" description="High-level (Z) Threshold Register for Ch3.">
		<bitfield id="HLTZ" width="15" begin="14" end="0" resetval="0x0" description="Unsigned High-level threshold [Z] for the comparator filter output  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator SDCMPHx, it does not have the ability to generate an interrupt." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFIFOCTL3" acronym="SDFM_SDFIFOCTL3" offset="122" width="16" description="FIFO Control Register for Ch3.">
		<bitfield id="OVFIEN" width="1" begin="15" end="15" resetval="0x0" description="SDFIFO Overflow interrupt enable  0:SDFIFO Overflow condition will not generate an interrupt  1:SDFIFO overflow condition generates an interrupt on SDy_ERR" range="15" rwaccess="R/W"/>
	<bitfield id="DRINTSEL" width="1" begin="14" end="14" resetval="0x0" description="Data-Ready Interrupt [DRINT] source select  0 = AF1          [Select non-FIFO data-ready interrupt]  1 = SDFFINT1 [Select FIFO data-ready interrupt]" range="14" rwaccess="R/W"/>
	<bitfield id="FFEN" width="1" begin="13" end="13" resetval="0x0" description="SDFIFO Enable  0: Disable FIFO operation 1: Enable FIFO operation  Note: When FIFO is disabled, FIFO contents are cleared" range="13" rwaccess="R/W"/>
	<bitfield id="FFIEN" width="1" begin="12" end="12" resetval="0x0" description="SDFIFO data ready Interrupt Enable" range="12" rwaccess="R/W"/>
	<bitfield id="SDFFST" width="5" begin="10" end="6" resetval="0x0" description="SDFIFO Status  00000 FIFO empty 00001 FIFO has 1 word  . . . . 10000 FIFO has 16 words" range="10:6" rwaccess="R"/>
	<bitfield id="SDFFIL" width="5" begin="4" end="0" resetval="0x0" description="SDFIFO interrupt level bits   The FIFO will generate an interrupt when the FIFO status [SDFFST] '= FIFO level [SDFFIL ] " range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDSYNC3" acronym="SDFM_SDSYNC3" offset="124" width="16" description="SD Filter Sync control for Ch3.">
		<bitfield id="WTSCLREN" width="1" begin="10" end="10" resetval="0x1" description="WTSYNFLG Clear-on-FIFOINT Enable  0:WTSYNFLG can only be cleared manually [using WTSYNCLR bit]  1:WTSYNFLG is cleared automatically on SDFFINT" range="10" rwaccess="R/W"/>
	<bitfield id="FFSYNCCLREN" width="1" begin="9" end="9" resetval="0x0" description="FIFO Clear-on-SDSYNC Enable  0:SDFIFO is not automaticaly cleared upon receiving SDSYNC   1:SDFIFO is automaticaly cleared upon receiving SDSYNC" range="9" rwaccess="R/W"/>
	<bitfield id="WTSYNCLR" width="1" begin="8" end="8" resetval="0x0" description="Wait-for-Sync Flag Clear [always reads 0]  0:Write of 0 has no effect  1:Write of 1 clears WTSYNFLG" range="8" rwaccess="R/W"/>
	<bitfield id="WTSYNFLG" width="1" begin="7" end="7" resetval="0x0" description="Wait-for-Sync Flag  0:SDSYNC event has not occurred  1:SDSYNC event occurred.  " range="7" rwaccess="R"/>
	<bitfield id="WTSYNCEN" width="1" begin="6" end="6" resetval="0x0" description="Wait-for-Sync Enable  0:Incoming Data written to SDFIFO on every Data-Ready [DR] Event  1:Incoming Data written to SDFIFO on DR event only after SDSYNC event occurs" range="6" rwaccess="R/W"/>
	<bitfield id="SYNCSEL" width="6" begin="5" end="0" resetval="0x0" description="Defines source for the SDSYNC Input on this channel  Refer SDSYNCx.SYNCSEL table" range="5:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT3CMPL2" acronym="SDFM_SDFLT3CMPL2" offset="126" width="16" description="Second low level threhold  for CH3.">
		<bitfield id="LLT2" width="15" begin="14" end="0" resetval="0x0" description="Second Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCTLPARM4" acronym="SDFM_SDCTLPARM4" offset="128" width="16" description="Control Parameter Register for Ch4.">
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1:SD Data is passed through a synchronizer." range="6" rwaccess="R/W"/>
	<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1:SD Clock is passed through a synchronizer." range="4" rwaccess="R/W"/>
	<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD4 Clock source select. 0:Clock source to SDFM filter is its channel clock. 1:Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="R/W"/>
	<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0:Mode0:Modulator clock running at 1x data rate 1:Reserved 2:Reserved 3:Reserved" range="1:0" rwaccess="R/W"/>
