ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/SDFM_SDFM_50268000h.xml
	</register><register id="SDFM_SDCOMP4EVT2FLTCLKCTL" acronym="SDFM_SDCOMP4EVT2FLTCLKCTL" offset="244" width="16" description="COMPL/CEVT2 Digital filter4 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP4EVT1FLTCTL" acronym="SDFM_SDCOMP4EVT1FLTCTL" offset="246" width="16" description="COMPH/CEVT1 Digital filter4 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP4EVT1FLTCLKCTL" acronym="SDFM_SDCOMP4EVT1FLTCLKCTL" offset="248" width="16" description="COMPH/CEVT1 Digital filter4 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP4LOCK" acronym="SDFM_SDCOMP4LOCK" offset="254" width="16" description="SD  compartor event filter4 Lock Register.">
		<bitfield id="COMP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the SDCOMP4EVT1/2FLTTCTL and COMP4FILCLKCTL registers.    0  SDCOMP4EVT1/2FLTCTL and SDCOMP4EVT1/2FLTCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  SDCOMP4EVT1/2FLTCTL and SDCOMP4EVT1/2FLTCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="R/W1TS"/>
	<bitfield id="SDCOMP4CTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the SDCOMP4CTL register.    0  SDCOMP4CTL register is not locked. Write 0 to this bit has no effect.   1  SDCOMP4CTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="R/W1TS"/>
	</register>
</module>